app/Controllers/Users.php

SELECT *
FROM `users`
 LIMIT 4, 2
SELECT COUNT(*) AS `numrows`
FROM `users`
---
    public function index()
    {
        $pager = \Config\Services::pager();
        $data = [
            'users' => $this->userModel->paginate(2),
            'pager' => $this->userModel->pager
        ];

INSERT INTO `users` (`name`, `email`, `mobile_number`, `gender`, `dob`, `age`) VALUES ('Rupesh Jha', 'rupaesah.jha.526@gmail.com', '7977451118', 'Male', '2024-05-24', '20')
---
    public function create()
    {
        helper('form');
        if ($this->request->getMethod() == 'POST')
        {
            $validation_rules = [
                'name'              => 'required',
                'email'             => 'required|valid_email|is_unique[users.email]',
                'mobile_number'     => 'required|max_length[10]',
                'gender'            => 'required',
                'dob'               => 'required',
                'age'               => 'required|integer|greater_than_equal_to[20]|less_than_equal_to[100]'
            ];
            if($this->validate($validation_rules))
            {
                $userData = [
                    'name' => $this->request->getPost('name'),
                    'email' => $this->request->getPost('email'),
                    'mobile_number' => $this->request->getPost('mobile_number'),
                    'gender' => $this->request->getPost('gender'),
                    'dob' => $this->request->getPost('dob'),
                    'age' => $this->request->getPost('age')
                ];

                $this->userModel->save($userData);

UPDATE `users` SET `name` = 'Pavan a', `email` = 'rupesh.jha.526@gmail.com', `mobile_number` = '7977451118', `gender` = 'Male', `dob` = '2024-05-17', `age` = '20'
WHERE `users`.`id_user` IN ('4')
DELETE FROM `addresses`
WHERE `id_user` = '4'
---
    public function edit($id)
    {
        helper('form');

        $data['user'] = $this->userModel->find($id);
        $data['addresses'] = $this->addressModel->getAddresses($id);

        if ($this->request->getMethod() == 'POST')
        {
            $validation_rules = [
                'name'          => 'required',
                'email'         => 'required|valid_email|is_unique[users.email,users.id_user,'.$id.']',
                'mobile_number' => 'required|max_length[10]',
                'gender'        => 'required',
                'dob'           => 'required',
                'age'           => 'required|integer|greater_than_equal_to[20]|less_than_equal_to[100]'
            ];

            if($this->validate($validation_rules))
            {
                $userData = [
                    'name' => $this->request->getPost('name'),
                    'email' => $this->request->getPost('email'),
                    'mobile_number' => $this->request->getPost('mobile_number'),
                    'gender' => $this->request->getPost('gender'),
                    'dob' => $this->request->getPost('dob'),
                    'age' => $this->request->getPost('age')
                ];

                $this->userModel->update($id, $userData);

                $this->addressModel->where('id_user', $id)->delete();