app/Models/AddressModel.php

SELECT *
FROM `addresses`
WHERE `id_user` = '4'
---
    public function getAddresses($id_user)
    {
        return $this->where('id_user', $id_user)->findAll();

INSERT INTO `addresses` (`address`, `city`, `id_user`, `pincode`, `state`)
VALUES ('Mirza dighu yadav chawl, goandevi road,','mumbai','4','400101','Maharashtra'), ('Mirza dighu yadav chawl, goandevi road,','mumbai','4','400101','Maharashtra')
---
    public function createAddressBatch($data)
    {
        return $this->insertBatch($data);